Revit 2026 API

# AnalysisDisplayDeformedShapeSettings Properties

---

The AnalysisDisplayDeformedShapeSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GridColor | Color of grid lines. |
|  | GridLineWeight | Line weight of grid lines. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Rounding | Increment to which numeric values of analysis results are rounded in deformed shape. |
|  | ShowContourLines | If true, show contour lines in the analysis display. |
|  | ShowGridLines | If true, show grid lines in the analysis display. |
|  | TextLabelType | Type of deformed shape text visualization. |
|  | TextTypeId | Element id of text associated with the settings. |
|  | Transparency | Transparency percentage of deformed shape color fill on surfaces |

#### Reference

AnalysisDisplayDeformedShapeSettings Class

Autodesk.Revit.DB.Analysis Namespace